### US_Baby_Names
* [캐글](https://www.kaggle.com/datasets/kaggle/us-baby-names)

In [30]:
import pandas as pd
import numpy as np
from IPython.display import display

csv_url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
baby_names = pd.read_csv(csv_url)
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [31]:
# 데이터 확인
display(baby_names.head(10))
print('-'*50)

# 'Unnamed: 0' 과 'id'는 필요 없어 보임
del baby_names['Unnamed: 0']
del baby_names['Id']
display(baby_names.head())

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

--------------------------------------------------

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [32]:
# 데이터셋에 어떤 성별이 더 많은지 확인
baby_names.Gender.value_counts()
# 여성이 더 많음

F    558846
M    457549
Name: Gender, dtype: int64

In [37]:
# 이름으로 그룹핑하고, 몇 번씩 나왔는지 확인
baby_names_group = baby_names.copy()

# Year 컬럼은 삭제하고 진행
del baby_names_group['Year']
# 그룹핑하고 내림차로 확인
names  = baby_names_group.groupby('Name').sum().sort_values('Count', ascending=False)
names

C:\Users\Administrator\AppData\Local\Temp\ipykernel_33652\3869883545.py:7: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  names  = baby_names_group.groupby('Name').sum().sort_values('Count', ascending=False)

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

In [46]:
# 데이터셋에 있는 이름의 개수는(유니크한 값)
print(len(names))

# 가장 많이 나온 이름은
names['Count'].idxmax()

17632

'Jacob'

In [59]:
# 가장 적게 나온 이름의 종류는 총 몇개인지

# 가장 적게 나온 값 확인
print(names.Count.min())

# Count가 min 값이랑 같은 이름의 개수 확인
len(names[names.Count == names.Count.min()])

5

2578

In [63]:
# 중간값 개수로 나온 이름 확인하기

# 중간값 개수 확인
print(names.Count.median())

# Count가 median 값이랑 같은 이름 확인
names[names.Count == names.Count.median()]

49.0

          Count
Name
Zuleima      49
Vita         49
Aziah        49
Kaedence     49
Antonina     49
...         ...
Mckynzie     49
Yoni         49
Hareem       49
Jkwon        49
Nazier       49

[66 rows x 1 columns]

In [65]:
# names(이름 개수에 대한)의 표준편차 확인
names.Count.std()

11006.0694678915

In [67]:
# mean, min, max, std, quartiles 값 요약하기
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000

In [71]:
# quantile 하나씩 볼 때는 quantile(값)으로 확인
names.Count.quantile(0.25)

11.0